import 'package:flutter_course/data/models/art_card.dart';

final cardsList = [
  ArtCard(
      day: '5 жовтня 2023',
      image: 'assets/images/Maksym_Mamsikov-Nora.jpeg',
      title: 'Максим Мамсіков - Нора',
      text: '\tСин художника-сімдесятника Владислава Мамсікова, Максим '
          'Мамсіков 1988 року вступив на графічний факультет Київського '
          'державного художнього інституту. Навчання перервала строкова '
          'служба в армії, яка завершилася 1991 року. Як зазначає сам '
          'художник, він повернувся в час великих змін, коли все вже '
          'було іншим — суспільство, погляди, мистецтво: «все, що було '
          'заборонено раніше, можна було спокійно пробувати»\n\n\tРоботу'
          ' «Нора» створено під впливом психотропних речовин, які '
          'художник спробував уперше в житті. У цій роботі Мамсікову '
          'хотілося засобами живопису проілюструвати невідомий йому '
          'раніше фізичний досвід. Художник зобразив самого себе, який '
          'лежить на підлозі, обіймаючи дівчину. Його голова ніби поринає'
          ' в стіну, виходячи за межі зображеної кімнати. Фізичне тіло '
          'залишається в інтер’єрі, проте свідомість художника вже '
          'досліджує інші виміри \n \n \tПряма мова про теми власного '
          'мистецтва: \n \t- Людина і світ. Я такий, і я — інший. Чи '
          'правда те, що я бачу, чи це намальовано. У нас, вибачте за '
          'подробиці, у вбиральні, у майстерні висить картина Шишкіна — '
          'ну ці його «Ведмедики» — десь на смітнику знайшли хлопці, '
          'пожартували, вставили в рамку. Я весь час і думаю: млинець, '
          'якби взяти центрального ведмедя – була б нормальна робота. '
          'Мені важливо, щоб залишалася якась порожнеча... А куди людині'
          ' подітися, якщо немає місця для глядача? Для кого це '
          'тоді?\n\n\tВикористані ресурси:\n'
          'https://archive.pinchukartcentre.org/reviews/rezyume\n'
          'https://kyivdaily.com.ua/maksim-mamsikov/\n\n Ще картин: '
          'https://archive.pinchukartcentre.org/artists/maksim-mamsikov',
      likesAmount: '158'),
  ArtCard(
      day: '6 жовтня 2023',
      image: 'assets/images/Svitlana_Tartakovska - Mariya.jpg',
      title: 'Світлана Тартаковська - Марія',
      text:
          'Вона народилася в Україні, в Житомирській області, у місті Бердичів. '
          'У 10 років вступила до художньої школи. Після трьох років навчання з '
          'батьками та сестрою переїхала до Німеччини. До Нідерландів українку '
          'привело кохання. Вже у Гронінгені Тартаковська вирішила піти до '
          'класичної академії, де художницю навчили, що ідея та образ не менш '
          'важливі за техніку\n\n\tПряма мова:\n\t- Коли я почала пошук – що я '
          'можу намалювати, то передусім мене надихали люди. Сама природа людини'
          '\n\n\tКожен із нас – це просто галактика. І це все мені хотілося '
          'передати. Особливо, люди, яких бачиш, які дивляться наче в пустоту, '
          'або хтось задумався над чимось, це завжди найцікавіші особистості. '
          'Тож я вирішила малювати людей, тому що це нескінченна подорож. '
          'Багато з моїх картин – це те ж саме, що щоденник писати, оскільки я '
          'відображаю у кожній картині той момент або ті переживання, які у '
          'мені вирують саме у той момент. Тому, якщо чесно, кожну картину '
          'важко віддавати і розлучатися з нею, бо це в якомусь сенсі я самаc- '
          'У картині кожен повинен упізнати, знайти себе. Я думаю, що у цьому і '
          'є сила хорошої картини. Написати не просто картину, а дзеркало, щоб '
          'кожна людина могла побачити свій образ, знайти частинку себе\n\n\t'
          'Використані ресурси:\nhttps://www.ukrinform.ua/rubric-culture/3031210'
          '-svitlana-tartakovska-ukrainska-hudoznica-z-niderlandiv.html\n\n '
          'Ще картин: https://gallery238.com/en/kunstenaars/svetlana-tartakovska/',
      likesAmount: '444'),
  ArtCard(
      day: '7 жовтня 2023',
      image: 'assets/images/Olga_Glumcher - Pro_krasu_grikha.jpeg',
      title: 'Ольга Глумчер - Про красу гріха',
      text:
          'Ольга Глумчер – сучасна молода художниця, яка активно виставляє свої '
          'роботи у країнах Європи та в Америці, живе та працює у Києві. Одним '
          'із її улюблених жанрів є портрет. Незвичайне бачення та майстерне '
          'зображення людей зробили багатьох відомих та впливових людей України '
          'її замовниками\n\n\tПряма мова:\n\t-Якщо розглядати мистецтво як із '
          'способів пізнання світу, то найважливішим об\'єктом дослідження для '
          'людини є сама людина. Тому і в живописі, і у графіку моя основна тема'
          ' – людина, особистість. Його страхи та бажання, ставлення до життя, '
          'смерті, інших людей... Навіть коли на картині на весь екран море (як '
          'у роботі «Всесвітній потоп», яка зараз в Італії на виставці «Права '
          'людини», організованої за участю Ради Європи) , тема картини - '
          'незахищеність окремої людини перед всепоглинаючою стихією. У '
          'контексті військових дій у моїй країні це зараз якось особливо чітко '
          'та страшно видно\n\n\t-У мене до своїх картин дуже легке ставлення. '
          'Іноді чую від художників, що їм важко розлучатися із картинами. Ні '
          'разу не відчувала таких почуттів\n\n\tВикористані ресурси:\n'
          'https://touch-magazine.eu/persons/touch-interview/olga-glumcher-obrazy'
          '-kartin-mne-prihodjat-pered-snom.html\n\n Ще картин: '
          'http://www.glumcher.com/',
      likesAmount: '291'),
  ArtCard(
      day: '8 жовтня 2023',
      image: 'assets/images/Victor_Khomenko-Nichni_Visii.jpg',
      title: 'Віктор Хоменко - Нічні візії',
      text: 'Віктор Хоменко  називав свої роботи «абстракціонізмом в '
          'імпресіонізмі». На полотні не можна побачити реальних предметів, '
          'явищ, подій, облич — художник передавав на ньому фарбами тільки свої '
          'особисті переживання і настрої, за допомогою крапель емалі. Тому, '
          'трактуваннях ці полотна не потребують. Лише чисті емоційні бризки, '
          'які кожен відчуває по-різному\n\n\tЙого захопила та повністю поглинула'
          ' відсутність будь-яких меж. Неможливо дати картині назву, та ще більш'
          ' неможливим є розповісти, що на ній зображено — це вир емоційного '
          'спалаху, що наче говорить вустами художника\n\n\tВіктору Миколайовичу'
          ' подобалися художники імпресіоністи, які намагалися «розчиняти» '
          'предмети в повітрі. Він і сам був тим, хто розчиняв у повітрі сліди '
          'пензля, створюючи фантоми своїх думок, які будуть полонити кожного '
          'через роки\n\n\tВикористані ресурси:\nhttps://nikopol.city/articles/'
          '141038/vin-tvoriv-emociyami-u-nikopoli-pomer-hudozhnik-viktor-homenko'
          '\n\n Ще картин: https://www.artmajeur.com/xv52'
          '\nhttps://gs-art.com/artists/5460/',
      likesAmount: '94')
];
